---
kind: enumMember
id: F:Autodesk.Revit.DB.LeaderShape.Straight
enum: Autodesk.Revit.DB.LeaderShape
source: html/116cbc39-8db2-b375-a42f-a6bf3c73df68.htm
---
# Autodesk.Revit.DB.LeaderShape.Straight

A single straight line between the end point and anchor point.